Revit 2024 API
BuiltInFailures.RoomFailures.RoomBaseAboveComputationHeight Property
 [RoomBase]'s lower offset is above the Computation Height
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RoomBaseAboveComputationHeight { get; }
Visual Basic
Public Shared ReadOnly Property RoomBaseAboveComputationHeight As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RoomBaseAboveComputationHeight {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace